const jin = `
笔画1

钇 钆
笔画2

针 钋 钉 钊 钌
笔画3

钕 钒 钑 钖 钎 钏 钐 钓 钗 钔 钍
笔画4

钘 钪 钙 钚 钬 钛 钡 钣 钠 钨 钜 钝 钞 钟 钢 钤 钥 钦 钧 钩 钫 钭 钮 钯
笔画5

钼 铂 铇 钶 钷 钵 铈 钽 铀 钰 铋 铁 铌 钱 钲 钳 钴 钸 钹 钺 钻 钾 钿 铃 铄 铅 铆 铉 铊 铍 铎
笔画6

铪 铧 铟 铱 铯 铑 铝 铖 铡 铒 铗 铙 铛 铜 铠 铢 铣 铤 铨 铩 铫 铬 铭 铮 铰 铲 铳 铴 银 铷 铚 铐 铞 铓 铥 铦 铵 铏 铔 铘 铕
笔画7

锉 锎 铼 锂 锕 铽 锃 锅 锌 锏 铹 铻 销 锁 锇 锈 锊 锋 锐 锑 锒 锓 锔 铸 铺 锄 链 铿 锆 锍
笔画8

锣 锠 锨 锳 锝 锧 锪 锰 锜 锚 锫 锘 锖 锗 锟 错 锛 锞 锡 锢 锤 锥 锦 锩 锬 锭 键 锯 锱
笔画9

锴 镅 锽 镁 镄 锿 镃 锷 镀 锲 锵 锶 锸 锹 锺 锻 锼 锾 镂 镌
笔画10

镋 镓 镍 镕 镒 镆 镇 镉 镊 镏 镐 镑 镔 镈 镎
笔画11

镗 镚 镠 镖 镘 镙 镛 镜 镝 镞 镟
笔画12

镤 镢 镡 镣 镦 镧 镩 镪 镫 镥 镨
笔画13

镬 镱 镭 镯 镰 镮
笔画14

镲
笔画15

镴 镳
笔画17

镵 镶`;

const mu = `笔画0

木 朩
笔画1

朰 未 末 本 札 朮 术
笔画2

朼 朲 朶 朳 朱 朴 朵 朸 朹 机 朻 朽 朾 朿 杀 杂 权 杁 朷
笔画3

杍 杛 杌 杧 杩 杄 杅 杆 杇 杈 杉 杋 李 杏 材 村 杒 杓 杕 杖 杗 杘 杙 杚 杜 杝 杞 束 杠 条 来 杨 极 杢 杊 杔 杦 杤 杣
笔画4

枦 枈 枡 枃 枬 枤 柹 枪 板 杺 枂 枧 杫 枛 柉 杹 枍 杰 杪 杬 杭 杮 杯 東 杲 杳 杴 杵 杶 杷 杸 杻 杼 杽 松 枀 构 枅 枇 枉 枊 枋 枌 枎 枏 析 枑 枒 枓 枔 枕 枖 林 枘 枙 枚 果 枝 枞 枟 枢 枣 枥 枨 枫 枭 柜 枠 枆 枩
笔画5

枾 査 栍 栈 栐 柋 栁 柪 栃 柼 枿 柠 桒 枴 枰 枱 柦 柟 枮 枯 枻 枼 柀 柁 柂 柃 柄 柅 柆 柈 柊 柍 柎 柏 某 柑 柒 染 柔 柕 柖 柗 柘 柙 柚 柛 柝 柞 柢 柣 柤 查 柧 柩 柫 柬 柭 柮 柯 柰 柱 柲 柳 柵 柶 柷 柸 柺 柽 柾 柿 栀 栅 标 栉 栊 栋 栌 栎 栏 树 桏 枲 枳 枵 架 枷 枸 枹 柨 桞 枺 栄 柌 栆 栂 柇
笔画6

桟 桇 枽 栶 栬 桝 桖 栤 栥 桠 栣 梛 桜 桦 栰 栛 栨 栗 柡 柴 栦 栒 栓 栔 栕 栖 栘 栿 栙 栚 栜 栝 栞 栟 栠 校 栢 栧 栩 株 栫 栭 栯 栱 栲 栳 栴 栵 样 核 根 栺 栻 格 栽 栾 桎 桐 桑 桓 桔 桕 桗 桘 桙 桚 桡 桢 档 桥 桧 桨 桩 梃 梆 條 梠 梴 棦 桀 桁 桂 桃 桤 桄 桅 框 案 桉 桊 桋 桌 桍 桪 栮 桛
笔画7

梺 梽 梿 梻 桸 椘 梹 梕 梶 桽 梍 梼 桾 梊 桻 桳 梌 梋 桫 桬 桭 桮 桯 桰 桱 桲 桴 桵 桶 桷 桹 桺 桼 桿 梀 梁 梂 梄 梅 梇 梉 梎 梏 梐 梒 梓 梔 梖 梗 梘 梙 梚 梜 梟 梡 梢 梣 梤 梥 梦 梧 梨 梩 梪 梫 梬 梭 梮 梯 械 梱 梲 梳 梵 梷 梸 检 棁 棂 棻 梈 楖 梑 椛 梞 梾
笔画8

椨 椚 椣 棭 椪 椞 検 椙 棴 椥 棛 椃 椬 椮 椤 椂 椈 棏 棃 棄 棅 棆 棇 棈 椫 棡 棢 棣 棤 棥 棧 棨 棪 棫 棬 森 棯 棰 棱 棲 棳 棵 棶 棷 棸 棹 棺 棼 棽 棾 棿 椀 椁 椄 椅 椆 椇 椉 椊 椋 椌 植 椎 椏 椐 椑 椒 椓 椔 椖 椟 椠 椭 椰 楇 楉 楮 楰 極 榔 椦 棉 棊 棋 棌 棍 棎 棐 棑 棒 棓 椕 棔 棕 棖 棗 棘 棙 棚 棜 棝 棞 棟 棠 楗 楛 楧 椡 椢 椝 琹 椧 椩 椗
笔画9

榌 榀 榅 榋 榘 椺 榊 楁 楆 棩 楌 楐 椻 榈 椯 椱 椲 椳 椴 椵 椶 椷 椸 椹 椼 椽 椾 椿 楀 楂 楃 楄 楅 楈 楊 楋 楍 楎 楏 楑 楒 楯 楱 楲 楳 楴 楶 楷 楸 楹 楺 楻 楼 概 榆 榇 榙 榳 榵 榾 槆 槌 槎 槐 榄 楓 楔 楕 楘 楙 楚 楜 楝 楞 楟 楠 楡 楢 楣 楤 楥 楾 楦 楨 楩 楪 楫 楬 業 槩 楽 榁 榉 楿 榃
笔画10

榩 槗 槚 槞 槓 槡 槜 槕 槖 槔 榡 槉 榏 榽 榚 榍 榎 榐 榑 榒 榓 榕 榖 榗 榛 榜 榝 榞 榟 榠 榢 榣 榤 榥 榦 榧 榨 榪 榫 榬 榭 榮 榯 榰 榱 榲 榴 榶 榷 榸 榹 榺 榻 榼 榿 槀 槁 槂 槃 槄 槅 槇 槈 槊 構 槍 槏 樇 樃 樄 樆 樋 模 樤 樥 樺 槑 槒 様 槛 槟 槠 槤 槨 槰 槝 槙
笔画11

樧 樫 樬 槯 樦 槿 樀 樁 樂 樅 樈 樉 樊 樌 樍 樎 樏 樐 樑 樒 樓 樔 樕 樖 樗 樘 標 樚 樛 樜 樝 樞 樟 樠 樢 樣 横 樯 樱 橄 檛 槢 槣 槥 槦 槧 槪 槫 槬 槭 槮 槱 槲 槳 槴 槵 槶 槷 槸 槹 槺 槻 槼 槽 槾 橗 橡 橢 橥 樭 樰 権 樮
笔画12

橳 橰 橶 橵 橸 橱 橺 橀 橭 樨 樲 樳 樴 樵 樶 樷 樸 樹 樻 樼 樽 樾 樿 橁 橂 橃 橅 橆 橇 橈 橉 橊 橋 橌 橍 橎 橏 橐 檇 檎 檖 檙 檝 檠 檤 檧 橑 橒 橓 橔 橕 橖 橘 橙 橛 橜 橝 橞 機 橽 橠 橣 橤 橦 橧 橨 橩 橪 橫 橬 橮 橯 橹 橼 檃 橷 橲 檨 橻 橴
笔画13

檅 檆 檈 檉 檊 檋 檌 檍 檏 檐 檑 檒 檓 檔 檕 檗 檘 檚 檜 檞 檟 檡 檢 檣 檥 檦 檩 檬 檴 櫆 橚 橾 橿 檀 檁 檂 檄 櫛 櫣 檪
笔画14

櫉 櫊 櫈 櫁 櫇 櫔 檫 檭 檮 檯 檰 檱 檲 檳 檵 檶 檷 檸 檹 檺 檻 檼 檽 檾 檿 櫀 櫂 櫃 櫄 櫅 櫎 櫒 櫗 櫙 櫚 櫡 櫭
笔画15

櫵 櫥 櫋 櫌 櫍 櫏 櫐 櫑 櫓 櫕 櫖 櫘 櫜 櫝 櫞 櫟 櫠 櫢 櫧 櫲 櫫 櫤 櫦
笔画16

櫷 櫸 櫨 櫩 櫪 櫬 櫮 櫯 櫰 櫱 櫴 櫹 櫽 櫿 欂 櫶
笔画17

欍 權 櫳 櫺 櫻 櫼 櫾 欀 欁 欃 欄 欅 欌
笔画18

欎 欆 欇 欈 欉 欋
笔画19

欕 欏 欐 欑 欒
笔画20

欓 欔 欗
笔画21

欖 欘 欙 欚 欛 欝
笔画22

欜
笔画24

欟 欞`;

const shui = `笔画0
氵
笔画2

汅 氾 氿 汀 汁 汃 汇 汉 汄 汈 氻
笔画3

汢 汑 汣 污 汌 汊 汋 汍 汎 汏 汐 汒 汓 汔 汕 汗 汘 汙 汚 汛 汜 汝 江 池 汤 汲 汷
笔画4

沩 沨 洰 汼 汵 泤 沘 沪 沣 汯 沃 沍 汥 汦 汧 汨 汩 汪 汫 泐 泛 汭 汰 汱 汳 汴 汶 汸 汹 決 汻 汽 汾 沁 沂 沄 沅 沆 沇 沈 沉 沋 沌 沏 沐 沑 沒 沔 沕 沖 沙 沚 沛 沜 沟 没 沤 沥 沦 沧 泲 沠 汮 汿 沎 沢 沞
笔画5

泦 泍 泘 泀 泋 沺 泻 泇 泎 泼 治 沼 沽 沾 沿 況 泂 泃 泄 泅 泆 泈 泊 泌 泏 泑 泒 泓 泔 法 泖 泗 泙 泜 泝 泞 泟 泠 泡 波 泣 泥 泧 注 泩 泪 泫 泬 泭 泮 泯 浅 泹 沫 沬 沭 沮 沰 沱 沲 河 沴 沵 沶 沷 沸 油 泱 泳 泷 泸 泺 泽 泾
笔画6

浕 浉 浄 浀 浂 洉 洡 洣 浐 洘 泚 浌 洼 洽 派 洿 浃 浇 浈 浊 测 浍 济 浏 浑 浒 浓 浔 泿 洱 涏 洀 洁 洂 洃 洄 洅 洆 洇 洈 洊 洋 洌 洎 洏 洐 洑 洒 洓 洔 洕 洗 洠 洙 洚 洛 洝 洞 洟 洢 洤 津 洦 洧 洨 洩 洪 洫 洬 洭 洮 洲 洳 洴 洵 洶 洷 洸 洹 洺 活 涎
笔画7

浗 淽 涥 浫 涃 浘 涩 洖 流 涧 浖 浙 浚 浛 浜 浝 浲 浞 浟 浠 浡 浢 浣 浤 浥 浦 浧 浩 浪 浬 涚 浨 淓 涁 涟 洍 涍 浱 浵 浭 浮 浯 浰 浴 浶 海 浸 浹 浺 浻 浼 浽 浾 浿 涀 涂 涄 涅 涆 涇 消 涉 涊 涌 涐 涑 涒 涓 涔 涕 涖 涗 涘 涛 涝 涞 涠 涡 涣 涤 润 涨 浳 涜 涢 涋 涙
笔画8

渋 渒 渇 淗 済 淧 渵 渌 淕 淣 涭 淁 淂 淃 淄 淅 淆 淇 淈 淉 淊 淋 淌 淍 淎 淏 淐 淑 淒 淔 淖 淘 淙 淚 淛 淜 淝 淞 淟 淠 淡 淢 湕 渔 渂 涹 涪 涫 涬 涮 涯 涰 涱 液 涳 涴 淿 涵 涶 涷 涸 涺 涻 涼 涽 涾 涿 淀 淤 淥 淦 淨 淩 淪 淫 淬 淮 淯 淰 深 淲 淳 淴 淶 混 渓 淸 淹 淺 添 渀 渁 渃 渄 清 渊 渍 渎 渐 渑 渖 渗 渚 渠 渦 渮 渶 渏 湴 淭 渉 渆 渕
笔画9

渪 満 溂 湙 溈 湾 渘 溉 湇 湼 渷 湐 湠 湚 湌 湅 湆 湉 湵 湊 湋 湍 湎 湏 湑 湒 湓 湔 湖 湗 湘 湛 湜 湝 湞 湟 湡 湢 湣 湦 湧 湨 湤 渼 滋 滑 滞 湽 渽 淵 渞 渙 湈 減 渜 渝 渟 渡 渢 渣 渤 渥 湥 湪 渧 渨 温 渫 測 渭 港 渰 渱 渲 渳 渴 游 渹 渺 渻 渾 渿 湀 湁 湃 湄 湩 湫 湭 湮 湯 湰 湱 湲 湳 湶 湷 湸 湹 湺 湻 湿 溃 溅 溚 溞 溠 溬 溲 溾 滁 溄 湂 溆 溋 溌 溇 溊 溁
笔画10

滟 滙 满 溤 溩 滪 澕 滛 滏 滘 滤 滣 溸 滜 溵 滝 滇 滈 滉 滌 滍 滐 滒 滓 滔 滖 滗 滢 滥 滦 滫 滭 溿 滨 滚 滠 溍 溎 溏 源 溑 溒 溓 溔 溕 準 溗 溘 溙 溛 滩 溜 溝 溟 溡 溢 溣 溥 溦 溧 溨 溪 溫 溭 溮 溯 溰 溱 溳 滊 溴 溶 溷 溹 溺 溻 溼 溽 滀 滂 滃 滄 滅 滆 滶 漓 漠 漣 漨 漭 漷 潃 滧
笔画11

潈 潌 漵 澚 漞 潉 潅 潊 滵 漝 漇 漈 滼 滬 滮 滯 潒 潢 漜 潄 漌 漍 滰 滱 滲 滳 滴 滷 滸 滹 滺 滻 滽 滾 滿 漁 漂 漃 漄 漅 漆 漉 漊 漋 漎 漏 漑 演 漕 漖 漗 漘 漙 漚 漛 漟 漡 潳 漢 漤 漥 漧 漩 漪 漫 漬 漮 漯 漰 漱 漲 漳 漴 漶 漸 漹 漺 漻 漼 漾 潀 潂 潆 潇 潋 潍 潎 潩 潴 澉 濄
笔画12

澘 澙 潱 潥 澓 澛 漽 潖 潐 澊 潑 潓 潔 潕 潗 潘 潙 潛 潜 潝 潟 潠 潡 潣 潤 潦 濆 濈 濍 濎 濐 漒 潶 潻 潏 潧 潨 潪 潫 潬 澅 潭 潮 潯 潰 潲 潵 潷 潸 潹 潺 潼 潽 潾 潿 澁 澂 澄 澆 澇 澈 澋 澌 澍 澎 澏 澐 澑 澒 澔 澖 澗 澜 澠 澫 澳 澻 澾 澝
笔画13

濓 潚 潞 濇 濉 濗 濊 濋 濑 濒 濖 濏 澞 澟 澡 澢 澣 澤 澥 澦 澧 澨 澪 澬 澭 澮 澯 澰 澱 澲 澴 澵 澶 澷 澸 澹 澺 澼 濨 澽 澿 激 濁 濂 濃 濅 濛 濩 濭 瀄 濸
笔画14

濕 濵 濶 濔 濘 澀 濣 濙 濝 濚 濜 濞 濟 濠 濡 濢 濤 濥 濦 濧 濪 濫 濬 濮 濯 濰 濱 濲 濴 濻 濿 瀁 瀇 瀎 瀞 瀡 濹
笔画15

瀔 瀒 濺 瀃 濼 濽 濾 瀀 瀂 瀅 瀆 瀈 瀉 瀊 瀋 瀌 瀍 瀏 瀐 瀑 瀓 瀢 瀦
笔画16

瀭 濳 瀕 瀖 瀗 瀘 瀙 瀚 瀛 瀜 瀝 瀟 瀠 瀣 瀤 瀥 瀨 瀩 瀫 瀯 瀮 瀳 瀬
笔画17

瀿 灀 灁 灂 灆 灌 瀧 瀰 瀱 瀲 瀴 瀵 瀶 瀷 瀸 瀹 瀺 瀻 瀼 瀽 瀾
笔画18

灐 灃 灄 灅 灇 灈 灉 灊 灋 灍 灏 灕
笔画19

灑 灒 灔 灖 灗 灘
笔画20

灜 灙 灚 灛 灡
笔画21

灝 灞 灟 灠
笔画22

灢 灣
笔画23

灎 灤 灦
笔画24

灧 灨
笔画28

灩
笔画29

灪`;

const huo = `笔画0

火
笔画1

灭
笔画2

灮 灲 灯 灱 灰 灳
笔画3

灾 灷 灶 災 灻 灹 灴 灵 灸 灺 灼 灿 炀
笔画4

炚 炍 炝 炈 炏 炗 炓 炉 炐 炞 炑 炌 炂 炃 炄 炅 炆 炊 炎 炒 炔 炕 炖 炘 炙 炛 炜 炬 炋 烎 炇
笔画5

炿 炾 炻 烀 炲 炠 烂 炢 炩 炴 炸 炟 炡 炣 炤 炥 炦 炧 炨 炪 炫 炭 炮 炯 炱 炳 炵 炶 炷 炼 炽 烁 烃
笔画6

烪 烨 烤 焒 烗 烉 烞 烌 烮 烬 烣 烒 烟 烠 烡 烢 烦 烧 烫 烄 烵 烆 烇 烊 烍 烐 烑 烓 烔 烕 烖 烘 烙 烚 烛 烜 烶 烻 烅 烩 烥
笔画7

焁 焗 烾 焖 焃 焔 焑 焐 焍 烯 烰 烼 烱 烳 烿 烲 烴 烷 烸 烺 烽 焀 焂 焅 焆 焇 焈 焊 焋 焌 焕 焫 焓
笔画8

煀 焷 焥 焿 焹 焝 焤 焙 焚 煑 焛 焜 焟 焨 焞 焠 焢 焧 焩 焪 焬 焭 焮 焯 焰 焱 焲 焳 焴 焵 焸 焺 焻 煐 煚 煡 煱 焼 焾 焽
笔画9

煷 煶 煵 煂 煴 煅 煲 煸 煺 煃 煁 煄 煆 煇 煈 煉 煊 煋 煌 煍 煏 煟 煒 煓 煔 煫 煖 煗 煘 煙 煜 煝 煠 煢 煣 煤 煥 煨 煩 煪 煬 煯 煰 熍 煳
笔画10

熕 熘 燁 熐 煿 熖 熔 熃 煾 熆 煹 煻 煼 熂 熗 煛 熎 煽 熀 熁 熄 熅 熇 熉 熋 熌 熑 熒 熓 熚 熢 熥
笔画11

熳 熴 熪 熵 熩 熫 熼 熤 熛 熜 熝 熞 熠 熡 熣 熦 熧 熨 熭 熮 熯 熰 熲 熿
笔画12

燵 燜 熶 熷 燍 熸 熺 熻 熾 燀 燂 燃 燄 燅 燆 燇 燈 燉 燊 燋 燌 燎 燏 燐 燑 燒 燓 燔 燖 燗 燘 燙 燚 營 燠 燤 燧 燪 燝
笔画13

燷 燴 熽 燛 燡 燢 燣 燥 燦 燨 燩 燫 燬 燭 燮 燯 燰 燱 燲 燳 燶
笔画14

燿 爀 爁 爃 燸 燹 燺 燻 燼 燽 爌 爗 爄
笔画15

爂 爅 爈 爉 爊 爍 爑 爕 爆 爎
笔画16

爋 爘 爏 爐 爒 爓 爔
笔画17

爖 爙 爚 爛 爝 爟
笔画18

爠 爜 爞 爡
笔画20

爣 爤
笔画21

爦 爥
笔画24

爧
笔画26

爨
笔画29

爩`;
const tu = `笔画0

土
笔画1

圠 圡
笔画2

圦 圢 圧 圤 圣 圥
笔画3

圸 在 地 场 圯 圹 圾 圷 圩 圬 圪 圫 圵 圳 圲 圭 圴 圮 圶 圱 赱
笔画4

坁 坅 坊 坑 坒 块 坋 坏 坆 坐 坠 坖 坂 坃 坉 坎 坍 坛 坟 坚 圻 坓 坙 坘 址 坄 均 坌 坝 坕 坈 圽 圼 坔 坜 圿 坞
笔画5

垉 坮 坣 坧 坩 坽 坤 坫 坴 坿 垆 坼 垈 坳 垄 坡 坵 坶 坺 坢 坦 坭 坱 坨 坯 坷 垂 垇 坪 坻 坥 垁 垃 垅 坲 垊 坬 垀 坸 坹 坾
笔画6

垰 垬 城 垘 垞 垌 垚 垢 垦 垯 垲 垑 垧 垒 垝 垠 垤 垹 埅 垍 垓 垴 垔 垗 垵 垟 垫 垪 垙 垜 垨 埩 垡 垖 垎 坰 型 垐 垣 埏 垛 垩 垳 垕 垱 垭 垥 垏 垮
笔画7

埖 埗 堲 埛 埌 埙 埊 垸 埋 埃 埐 埑 垽 埚 埇 垼 垶 垿 埘 垾 埄 垷 埀 埈 埔 埕 埉 埒 垻 埆 埍 埁 垺 埂 埓
笔画8

堒 堍 堓 埥 埮 埴 堅 埻 堈 埽 堇 堀 堝 堁 堄 埞 堃 埯 堂 埵 堎 培 埝 執 堵 埣 域 埳 堕 堏 埶 基 埪 埫 埰 埾 堆 埜 埠 埬 埤 埱 埲 堊 埡 埧 埿 埸 堋 堌 堐 埢 埨 埭 埦 堉 堔 埼 堑
笔画9

塅 塆 堳 堼 塊 塁 塇 堡 堩 堭 堹 堜 堫 場 堸 塦 堢 堚 堾 堛 堦 堷 堣 堯 塠 堮 堨 堪 堠 堺 堙 堘 堰 塭 堶 堿 堞 堤 堧 塔 堟 塂 堬 堻 塟 塃 堥 堗 報 塈 塄 堖 塀
笔画10

塰 塮 塉 塌 塢 墎 墷 墓 塻 塩 塝 塱 塨 塋 塞 塪 塡 塐 塕 塥 塯 塒 塖 塘 塜 塣 塤 塍 塳 塓 塛 堽 塏 塬 塚 塎 塑 填 塧 塗 塙
笔画11

墭 墸 墊 墌 塾 墂 境 墄 墅 塲 墖 塶 塷 塺 塽 墆 墘 塹 墈 墉 塿 墮 墑 墛 塵 塼 墍 墜 墚 墋 墬 塴 墁 墇 墐 墔 墒 墴 塸 墟 墏 墕 増 墙
笔画12

墥 墧 墹 墳 墨 墱 墦 墵 墀 墡 墪 墢 墺 墠 墯 墝 墫 墲 墰 墣 墩 增 墤 墶
笔画13

壂 壋 壌 壀 壉 壇 壒 墿 墼 壁 壃 墽 墻 壅 壄 墾 壊 壆 壈
笔画14

壗 壑 壓 壙 壐 壕 壍 壎 壏 壔 壖
笔画15

壝 壘
笔画16

壚 壞 壛 壜 壢 壡
笔画17

壟 壦 壣 壤 壠 壥
笔画19

壧
笔画20

壨
笔画21

壩
笔画22

壪`;
const shi = `笔画0

石
笔画2

矵 矴 矶
笔画3

矽 矷 矿 码 砐 矾 矸 矹 矺 矻 矼 砀
笔画4

砄 砙 砈 砃 砘 砛 砗 砋 砕 砓 砜 砇 砂 砅 砆 砉 砊 砌 砍 砎 砏 砑 砒 研 砖 砚 砭
笔画5

砡 砹 砽 砶 砼 砞 砪 砳 砨 砿 砸 砷 砾 础 硁 砱 砝 砟 砠 砢 砣 砤 砥 砧 砩 砫 砬 砮 砯 砰 砲 破 砵 砺 砻
笔画6

硛 硚 硆 硓 硘 硖 硙 硊 硂 硃 硄 硅 硇 硈 硉 硌 硍 硎 硏 硐 硕 硗 硟 碀 硭 砦 硑 硒 硔 硋
笔画7

硳 硱 硶 硰 硜 硝 硞 硠 硡 硢 硣 硤 硥 硦 硧 硨 硩 硪 硫 硬 确 硯 硷 硵 硲 硴
笔画8

碘 碚 碗 碙 碰 碋 碢 硸 硹 硺 硻 硼 硽 硾 硿 碁 碂 碃 碄 碅 碆 碇 碈 碉 碊 碌 碍 碎 碏 碐 碑 碒 碓 碔 碕 碖 碛 碜 碤
笔画9

碵 磀 碳 碲 碸 碷 碮 碝 碞 碟 碠 碡 碣 碥 碦 碧 碨 碩 碪 碫 碬 碭 碯 碱 碴 磁 磆 磈 磋 磓 碶 碹
笔画10

磗 磙 磘 磔 磕 磝 磤 磃 確 碻 碼 碽 碾 碿 磂 磄 磅 磇 磉 磊 磌 磍 磎 磏 磐 磑 磒
笔画11

磮 磖 磚 磛 磜 磞 磟 磠 磡 磢 磣 磥 磦 磧 磨 磩 磪 磫 磬 磭 磲 磺
笔画12

礀 礁 礅 磯 磰 磱 磳 磴 磵 磶 磷 磸 磹 磻 礇 磼 磽 磾 礄 磿 礈 礍 礂 礃
笔画13

礖 礡 礠 礆 礉 礊 礋 礌 礎 礏 礐 礑 礒 礓 礔 礕 礚 礜 礞
笔画14

礢 礗 礘 礙 礛 礝 礟 礣 礤 礦 礪
笔画15

礥 礧 礨 礩 礫 礬
笔画16

礳 礭 礮 礯 礰 礴
笔画17

礲 礷 礱 礵 礶
笔画19

礸 礹`;
const qi = `笔画0

气
笔画1

氕
笔画2

気 氖 氘
笔画3

氙 氚
笔画4

氛 氜 氝
笔画5

氡 氠 氢 氞 氟
笔画6

氦 氩 氧 氣 氤 氨 氥
笔画7

氫 氪
笔画8

氯 氬 氭 氮 氰
笔画9

氱 氲
笔画10

氳`;

const elementPeriodicTable =
  "氢氦锂铍硼碳氮氧氟氖钠镁铝硅磷硫氯氩钾钙钪钛钒铬锰铁钴镍铜锌镓锗砷硒溴氪铷锶钇锆铌钼锝钌铑钯银镉铟锡锑碲碘氙铯钡镧铈镨钕钷钐铕钆铽镝钬铒铥镱镥铪钽钨铼锇铱铂金汞铊铅铋钋砹氡钫镭锕钍镤铀镎钚镅锔锫锎锿镄钔锘铹鿏鿔鉨镆鉝";

module.exports = {
  jin,
  mu,
  shui,
  huo,
  tu,
  shi,
  qi,
  elementPeriodicTable,
};
